test/data/CHED-PP/C085_check/clearance-request.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:oas="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
  <soap:Header>
    <oas:Security soap:role="system" soap:mustUnderstand="true">
      <oas:UsernameToken>
        <oas:Username>systemID=ALVSHMRCCDS,ou=gsi systems,o=defra</oas:Username>
        <oas:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">password</oas:Password>
      </oas:UsernameToken>
    </oas:Security>
  </soap:Header>
  <soap:Body>
        <ALVSClearanceRequest xmlns="http://submitimportdocumenthmrcfacade.types.esb.ws.cara.defra.com">
            <ServiceHeader>
                <SourceSystem>CDS</SourceSystem>
                <DestinationSystem>ALVS</DestinationSystem>
                <CorrelationId>35546965010</CorrelationId>
                <ServiceCallTimestamp>2025-05-20T04:00:01.001</ServiceCallTimestamp>
            </ServiceHeader>
            <Header>
                <EntryReference>24GBBGBKCDMS965012</EntryReference>
                <EntryVersionNumber>1</EntryVersionNumber>
                <DeclarationUCR>4GB979990102001-0965-010</DeclarationUCR>
                <DeclarationType>S</DeclarationType>
                <SubmitterTURN>GB998038429000</SubmitterTURN>
                <DeclarantId>GB998038429000</DeclarantId>
                <DeclarantName>GB998038429000</DeclarantName>
                <DispatchCountryCode>MA</DispatchCountryCode>
                <GoodsLocationCode>DEUDEUDEU</GoodsLocationCode>
            </Header>
            <Item>
                <ItemNumber>1</ItemNumber>
                <CustomsProcedureCode>4000000</CustomsProcedureCode>
                <TaricCommodityCode>0603130000</TaricCommodityCode>
                <GoodsDescription>Carrots</GoodsDescription>
                <ConsigneeId>GB425343611000</ConsigneeId>
                <ConsigneeName>GB425343611000</ConsigneeName>
                <ItemNetMass>27</ItemNetMass>
                <ItemOriginCountryCode>MA</ItemOriginCountryCode>
                <Document>
                    <DocumentCode>9115</DocumentCode>
                    <DocumentReference>CHEDPP.GB.2025.1005020</DocumentReference>
                    <DocumentStatus>AE</DocumentStatus>
                    <DocumentControl>P</DocumentControl>
                    <DocumentQuantity />
                </Document>
                <Document>
                    <DocumentCode>C085</DocumentCode>
                    <DocumentReference>CHEDPP.GB.2025.1005021</DocumentReference>
                    <DocumentStatus>AE</DocumentStatus>
                    <DocumentControl>P</DocumentControl>
                    <DocumentQuantity />
                </Document>
                <Document>
                    <DocumentCode>N851</DocumentCode>
                    <DocumentReference>CHEDPP.GB.2025.1005022</DocumentReference>
                    <DocumentStatus>AE</DocumentStatus>
                    <DocumentControl>P</DocumentControl>
                    <DocumentQuantity />
                </Document>
                <Check>
                    <CheckCode>H219</CheckCode>
                    <DepartmentCode>PHSI</DepartmentCode>
                </Check>
            </Item>
         </ALVSClearanceRequest>
    </soap:Body>
</soap:Envelope>